Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/mint-upgrade.tmx
Source language: en
Languages: sv

source: Otherwise these packages can create conflicts.
sv: Dessa paket kan annars orsaka konflikter.

source: Let's go!
sv: Sätt igång!

source: Reboot your computer.
sv: Starta om datorn.

source: %d packages still need to be updated (%d kept, %d deleted)
sv: %d paket behöver fortfarande uppdateras (%d behållna, %d borttagna)

source: needs to be installed
sv: behöver installeras

source: Power source
sv: Strömkälla

source: The following packages need to be downgraded back to official versions:
sv: Följande paket behöver nedgraderas till officiella versioner:

source: Supported Linux Mint version
sv: Stödd version av Linux Mint

source: Package
sv: Paket

source: Operation
sv: Åtgärd

source: This program will ask you some questions and upgrade your operating system.
sv: Programmet kommer att ställa några frågor och uppgradera ditt operativsystem.

source: /etc/fstab was modified during the upgrade.
sv: /etc/fstab ändrades under uppgraderingen.

source: A series of tests will now be performed to prepare the computer for the upgrade.
sv: En rad tester kommer nu att göras för att förbereda datorn för uppgraderingen.

source: Removed packages
sv: Borttagna paket

source: These repositories need to be disabled.
sv: Dessa förråd behöver inaktiveras.

source: Unwanted removals
sv: Oönskade borttagningar

source: Session inhibition
sv: Sessionshämning

source: Upgrade phase
sv: Uppgradering

source: Phase 1: Preparation
sv: Steg 1: Förberedelse

source: Your version of Linux Mint is unknown. /etc/linuxmint/info is missing.
sv: Din version av Linux Mint är okänd. Filen /etc/linuxmint/info saknas.

source: The following operations need to be performed:
sv: Följande åtgärder behöver utföras:

source: An error occurred while downloading the packages.
sv: Ett fel uppstod vid hämtning av paketen.

source: A few more tests will be run and package updates will be downloaded.
sv: Ytterligare tester körs och paketuppdateringarna hämtas.

source: Requirements
sv: Krav

source: Reboot the computer for all the changes to take effect.
sv: Starta om datorn för att aktivera ändringarna.

source: Kept packages
sv: Behållna paket

source: Additional information
sv: Ytterligare information

source: In some rare cases orphan packages can interfere with the upgrade.
sv: I sällsynta fall kan föräldralösa paket störa uppgraderingen.

source: The upgrade was successful.
sv: Uppgraderingen lyckades.

source: Installed Version
sv: Installerad version

source: Upgrade Tool
sv: Uppgraderingsverktyg

source: Upgrade preparation
sv: Förberedelse inför uppgradering

source: Don't hesitate to seek help on the forums and the chat room.
sv: Tveka inte att söka hjälp i våra forum och i chattrummet.

source: Checking the APT cache...
sv: Kontrollerar APT-cachen…

source: Linux Mint version
sv: Version av Linux Mint

source: The package repositories need to point towards the new release (%s/%s).
sv: Paketförråden måste peka på den nya utgåvan (%s/%s).

source: Your architecture of Linux Mint is '%s'. It cannot be upgraded.
sv: Arkitekturen för Linux Mint är '%s'. Den kan inte uppgraderas.

source: About
sv: Om programmet

source: Finalizing the upgrade...
sv: Avslutar uppgraderingen…

source: The following problems were found:
sv: Följande problem hittades:

source: Held packages
sv: Återhållna paket

source: Backup and then delete these files to continue.
sv: Säkerhetskopiera filerna och radera dem sedan för att fortsätta.

source: needs to be removed
sv: behöver tas bort

source: If the upgrade isn't successful, a system snapshot will allow you to go back in time and revert all the changes.
sv: Om uppgraderingen skulle misslyckas kan en systemavbild användas för att återställa systemet till fungerande tillstånd.

source: Checking package repositories...
sv: Kontrollerar paketförråd…

source: Check again
sv: Kontrollera igen

source: Phase 2: Simulation and download
sv: Steg 2: Simulering och hämtning

source: Removing newly orphaned packages...
sv: Tar bort paket som nyligen blivit föräldralösa…

source: An issue was detected during the upgrade.
sv: Ett problem upptäcktes under uppgraderingen.

source: Checking the power source...
sv: Kontrollerar strömkällan…

source: Official version
sv: Officiell version

source: A copy of the modified file was saved as /etc/fstab.upgraded
sv: En kopia av den ändrade filen sparades som /etc/fstab.upgraded

source: The packages will now be upgraded.
sv: Paketen kommer nu att uppgraderas.

source: Recent Timeshift snapshot
sv: Senaste Timeshift-systemavbilden

source: Recommended solution
sv: Rekommenderad lösning

source: Fix
sv: Åtgärda

source: Quit
sv: Avsluta

source: Some of your packages are broken. Run 'apt install -f' to fix the issue.
sv: Några av dina paket är trasiga. Kör 'apt install -f' för att åtgärda detta.

source: Upgrading will perform the following changes.
sv: Uppgraderingen kommer att medföra följande ändringar.

source: Upgrading the system...
sv: Uppgraderar systemet…

source: This should have be done by the Upgrade Tool already.
sv: Detta borde redan ha gjorts av Uppgraderingsverktyget.

source: The following sources are defined in DEB822 format. This format isn't supported yet.
sv: Följande källor har DEB822-format. Detta format stöds ännu inte.

source: Package download
sv: Hämtning av paket

source: Pointing to the new release...
sv: Pekar mot den nya utgåvan…

source: The following packages could not be installed:
sv: Följande paket kunde inte installeras:

source: Archive
sv: Arkiv

source: Preparing the upgrade...
sv: Förbereder uppgraderingen…

source: The following error occurred:
sv: Följande fel inträffade:

source: Package repositories
sv: Paketförråd

source: Your package cache can't refresh correctly. Run 'apt update' and fix the errors it displays.
sv: APT-cachen kunde inte uppdateras. Kör 'apt update' och åtgärda de fel som visas.

source: Looking for held packages...
sv: Söker efter återhållna paket…

source: Foreign packages
sv: Främmande paket

source: System snapshots
sv: Systemavbilder

source: Checking system snapshots...
sv: Kontrollerar systemavbilder…

source: Download size: %s. Additional space needed: %s.
sv: Hämtningsstorlek: %s. Ytterligare utrymme behövs: %s.

source: Held packages can break the upgrade.
sv: Återhållna paket kan göra att uppgraderingen misslyckas.

source: mint-meta-codecs could not be installed.
sv: mint-meta-codecs kunde inte installeras.

source: Your edition of Linux Mint is '%s'. It cannot be upgraded to %s.
sv: Din Linux Mint-utgåva är '%s'. Den kan inte uppgraderas till %s.

source: The following packages are held:
sv: Följande paket är återhållna:

source: Phase 3: Upgrade
sv: Steg 3: Uppgradering

source: The following repositories do not explicitly support your version of Linux Mint.
sv: Följande förråd stöder inte uttryckligen din version av Linux Mint.

source: Final phase
sv: Avslutning

source: Your APT policy is incorrect.
sv: Dina APT-inställningar är felaktiga.

source: Re-run the Upgrade tool so that it migrates the repositories again.
sv: Kör Uppgraderingsverktyget igen så att paketförråden migreras på nytt.

source: Inhibiting session...
sv: Hämmar sessionen…

source: Go through the list above and make sure you are happy with the removals before going further with the upgrade.
sv: Gå igenom nedanstående lista och se till så att du är nöjd med borttagningarna innan du fortsätter med uppgraderingen.

source: Use apt-get in a terminal to troubleshoot and solve the issue.
sv: Använd apt-get i ett terminalfönster för att felsöka och lösa problemet.

source: If you decide to uninstall some of these packages press 'Check again' after their removal.
sv: Om du väljer att avinstallera några av dessa paket, klicka på 'Kontrollera igen' efter att de har tagits bort.

source: You need %s on '%s' but only have %s. You must free an additional %s.
sv: Du behöver %s på '%s' men har bara %s. Du måste frigöra ytterligare %s.

source: Your operating system is not up to date. Apply available updates before attempting the upgrade.
sv: Operativsystemet är inte uppdaterat. Installera alla uppdateringar innan du försöker uppgradera.

source: Packages updated: %d, added: %d , kept: %d, deleted: %d
sv: Uppdaterade paket: %d, tillagda: %d, behållna: %d, borttagna: %d

source: To ensure a successful boot, the upgrade tool restored your original /etc/fstab
sv: För att säkerställa en lyckad uppstart återställde uppgraderingsverktyget din ursprungliga /etc/fstab

source: %s is not up to date. Switch to a different mirror.
sv: %s är inte uppdaterad. Byt till en annan spegel.

source: Added packages
sv: Tillagda paket

source: Downloading packages...
sv: Hämtar paket…

source: %s does not support %s
sv: %s stöder inte %s

source: Applied software updates
sv: Installerade programuppdateringar

source: The simulation was not successful.
sv: Simuleringen misslyckades.

source: Checking your version of Linux Mint...
sv: Kontrollerar din version av Linux Mint…

source: Connect the computer to a power source before attempting to upgrade.
sv: Anslut datorn till ett eluttag innan du försöker uppgradera.

source: Your package repositories will now point towards the new release.
sv: Dina paketförråd kommer nu att peka på den nya utgåvan.

source: %s could not be installed.
sv: %s kunde inte installeras.

source: Press 'Fix' to perform a system snapshot.
sv: Klicka på ”Åtgärda” för att skapa en systemavbild.

source: Simulating upgrade to check hard disk space and potential issues...
sv: Simulerar uppgraderingen för att kontrollera diskutrymme och hitta eventuella problem…

source: Your version of Linux Mint is '%s'. Only %s can be upgraded to %s.
sv: Din version av Linux Mint är '%s'. Endast %s kan uppgraderas till %s.

source: These requirements are there to guarantee a safe upgrade. Only disable them if you know what you are doing.
sv: Dessa krav är till för att garantera en säker uppgradering. Inaktivera dem bara om du vet vad du gör.

source: Upgrade simulation
sv: Simulerad uppgradering

source: Upgrade to %s
sv: Uppgradera till %s

source: The information below might help solve the issue.
sv: Nedanstående information kanske kan lösa problemet.

source: Press 'OK' to continue with the upgrade.
sv: Klicka på ”OK” för att fortsätta uppgraderingen.

source: Looking for orphan packages...
sv: Söker efter föräldralösa paket…

source: Orphan packages
sv: Föräldralösa paket

source: %s is unreachable
sv: %s kan inte nås

source: This is a sign that something is wrong and needs to be fixed before going further.
sv: Detta visar att någonting är fel och behöver åtgärdas innan du fortsätter.

source: Preferences
sv: Inställningar

source: Looking for foreign packages...
sv: Söker efter främmande paket…

source: Upgrading would remove the following important packages:
sv: En uppgradering skulle ta bort följande viktiga paket:

source: Were the repositories modified since?
sv: Har förråden ändrats sedan dess?

source: Note: Ideally, no packages should be kept. This might indicate an issue.
sv: Notering: Det bästa är om inga paket behålls. Detta kan tyda på problem.

source: The following packages do not exist in the repositories:
sv: Följande paket finns inte i förråden:
